app/controllers/users_controller.rb

  def login
    if logged_in?
      redirect_to day_lives_path
      return
    end
    @user = User.find_by_username(params[:users][:username].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "admin"], ["LIMIT", 1]]